app/views/genres/index.html.erb

            <td><%= genre.genre %></td>
            <% Subgenre.where(:genre_id => genre.id).each do |subgenre|%>
---
SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`genre_id` = 1