app/views/questions/_form.html.erb

SELECT `genres`.* FROM `genres`
---
    <%= form.label :genre %>
    <%= form.collection_select(:genre, Genre.all, :id, :genre ) %>

SELECT `subgenres`.* FROM `subgenres`
---
    <%= form.label :subgenre %>
    <%= form.collection_select(:subgenre ,Subgenre.all, :id, :name ) %>