app/views/questions/genres.html.erb

SELECT `genres`.* FROM `genres`
---
&nbsp;
<%Genre.all.each do |genre|%>

SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`genre_id` = 1
---
     <div id="<%= genre.id %>" class="collapse">
         <% Subgenre.where(:genre_id => genre.id).each do |x| %>