app/views/leaderboards/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
---
      <tr>
           <td><%= User.find(leaderboard.user).username %></td>
          <td><%= Genre.find(leaderboard.genre).genre %></td>
          <td><%= Subgenre.find(leaderboard.subgenre).name %></td>