app/views/sessions/profile.html.erb

SELECT  `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
---
          <tr>
            <td><%= Genre.find(leaderboard.genre).genre %></td>
            <td><%= User.find(leaderboard.user).username %></td>
            <td><%= Subgenre.find(leaderboard.subgenre).name %></td>