app/controllers/genres_controller.rb

SELECT `genres`.* FROM `genres`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
    def index
        @genres=Genre.all
        @current_user = User.find session[:user_id]

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def new
        @genre=Genre.new
        @current_user = User.find session[:user_id]

INSERT INTO `genres` (`genre`, `description`, `created_at`, `updated_at`) VALUES ('asdf', 'asdf', '2017-09-17 11:41:56', '2017-09-17 11:41:56')
---
    def create
        @genre = Genre.new(genre: genre_params[:genre],description: genre_params[:description])
        if @genre.save