app/controllers/leaderboards_controller.rb

  def index
     @current_user=User.find session[:user_id]
    @leaderboards = Leaderboard.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards`

    def set_leaderboard
      @leaderboard = Leaderboard.find(params[:id])
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`id` = 1 LIMIT 1