app/controllers/questions_controller.rb

    def index
        @questions = Question.all
        #@questions.sort {|a,b| a.text <=> b.text}
        @user = User.find session[:user_id]
        @choices=Choice.all
---
SELECT `questions`.* FROM `questions`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `choices`.* FROM `choices` WHERE `choices`.`question_id` = 1

    def show
        @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

    def new
        @question = Question.new
        @genres=Genre.all
        @subgenres=Subgenre.all
        @user = User.find session[:user_id]
---
SELECT `genres`.* FROM `genres`
SELECT `subgenres`.* FROM `subgenres`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def edit
        @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 21 LIMIT 1

    def genres
        @movies=Subgenre.where(:genre_id => 1)
---
SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`genre_id` = 1

    def create
        @current_user = User.find session[:user_id]
        if @current_user.admin
            pa=question_params
            s=pa[:subgenre]
            b=Subgenre.find s.to_i
            @question= Question.new(question: pa[:question],correct_ans: pa[:a]+pa[:b]+pa[:c]+pa[:d],subgenre_id: s)
            if @question.save && b.genre_id == pa[:genre].to_i
                p @choice1 = Choice.new(text: pa[:option1],correct: pa[:a],question_id: @question.id)
                p @choice2 = Choice.new(text: pa[:option2],correct: pa[:b],question_id: @question.id)
                p @choice3 = Choice.new(text: pa[:option3],correct: pa[:c],question_id: @question.id)
                p @choice4 = Choice.new(text: pa[:option4],correct: pa[:d],question_id: @question.id)
                if @choice1.save && @choice2.save && @choice3.save && @choice4.save
                    flash[:notice] = "Question created"
                    flash[:color] = "valid"
                    redirect_to questions_path
                else
                    @question.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
SELECT `genres`.* FROM `genres`
INSERT INTO `questions` (`question`, `option1`, `option2`, `option3`, `option4`, `correct_ans`, `genre`, `created_at`, `updated_at`) VALUES ('asfasdf', 'asdfasd', 'asdfasdf', 'asdfasd', 'asdfasd', 'asdfasdf', 'asdfasdf', '2017-09-16 19:39:37', '2017-09-16 19:39:37')
INSERT INTO `choices` (`text`, `correct`, `question_id`, `created_at`, `updated_at`) VALUES ('asdf', 1, 4, '2017-09-19 16:15:53', '2017-09-19 16:15:53')
DELETE FROM `questions` WHERE `questions`.`id` = 13

    def sports
        @user = User.find session[:user_id]
        @sports = Genre.where(:genre => "SPORTS")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `genres`.* FROM `genres` WHERE `genres`.`genre` = 'SPORTS'

    def social
        @user = User.find session[:user_id]
        @social=Question.where(:genre => "social")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`genre` = 'social'

    def destroy
        @current_user = User.find session[:user_id]
        if @current_user.admin
            @question.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 1

    def set_question
        @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 20 LIMIT 1