app/controllers/quiz_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`name` = 'Tollywood'
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
SELECT  1 AS one FROM `leaderboards` WHERE `leaderboards`.`genre` = 1 AND `leaderboards`.`user` = 3 AND `leaderboards`.`subgenre` = 1 LIMIT 1
---
    def index
        @subgenre = params[:subgenre]
        @current_user=User.find session[:user_id]
        id=Subgenre.where(:name => session[:subgenre])[0]
        x=Subgenre.find(id.id).genre_id
        l=Leaderboard.where(genre: x,user: session[:user_id], subgenre: id.id)
        if !l.empty?

SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`name` = 'BOLLYWOOD' ORDER BY `subgenres`.`id` ASC LIMIT 1 OFFSET 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`subgenre_id` = 1
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = NULL LIMIT 1
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`genre` = 1 AND `leaderboards`.`user` = 3 AND `leaderboards`.`subgenre` = 1
SELECT  1 AS one FROM `leaderboards` WHERE `leaderboards`.`genre` = 1 AND `leaderboards`.`user` = 3 AND `leaderboards`.`subgenre` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards`
INSERT INTO `leaderboards` (`genre`, `user`, `subgenre`, `question`, `total_qns`, `attempted`, `score`, `created_at`, `updated_at`) VALUES (1, 3, 1, 0, 2, 2, 0, '2017-09-20 07:15:13', '2017-09-20 07:15:13')
---
    def start
        if session[:subgenre]
            id=Subgenre.where(:name => session[:subgenre])[0]
            all = Question.where(:subgenre_id => id).map {|x| x.id}
            total = all.length
            session[:questions] = all.sort_by{rand}[0..(total-1)]
            id=Subgenre.where(:name => session[:subgenre])[0]
            x=Subgenre.find(id.id).genre_id
            l=Leaderboard.where(genre: x,user: session[:user_id], subgenre: id.id)
            if !l.empty?
                session[:total]   = l[0].total_qns
                session[:current] = l[0].question
                session[:correct] = l[0].score / 100
                session[:not_attempted] = l[0].total_qns - l[0].attempted
            else
                session[:total]   = total
                session[:current] = 0
                session[:correct] = 0
                session[:not_attempted] = 0
                new_l = Leaderboard.create!(genre: x,user: session[:user_id],subgenre:id.id,question: session[:current],total_qns:total,attempted:total - session[:not_attempted],score:0)

SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`name` = 'Tollywood'
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`genre` = 1 AND `leaderboards`.`user` = 3 AND `leaderboards`.`subgenre` = 1
DELETE FROM `leaderboards` WHERE `leaderboards`.`id` = 31
---
    def destroy
        id=Subgenre.where(:name => session[:subgenre])[0]
        x=Subgenre.find(id.id).genre_id
        l=Leaderboard.where(genre: x,user: session[:user_id], subgenre: id.id)
        l.destroy_all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = NULL LIMIT 1
SELECT `choices`.* FROM `choices` WHERE `choices`.`question_id` = 4
---
    def question
        @current = session[:current]
        @total   = session[:total]
        @current_user=User.find session[:user_id]
        if @current >= @total
            redirect_to :action => "end"
            return
        end

        @question = Question.find(session[:questions][@current])
        @choices = @question.choices.sort_by{rand}
        if @question.correct_ans.length == 1

SELECT `choices`.* FROM `choices` WHERE `choices`.`question_id` = 1
---
    def answer
        @current = session[:current]
        @total   = session[:total]
        choiceid = params[:choice]
        if choiceid == nil
            session[:not_attempted] = session[:not_attempted] + 1
            @current+=1
            session[:current]=@current
            if @current >= @total
                redirect_to :action => "end"
            else
                redirect_to "/quiz/question"
            end
        else
            @question = session[:question]
            @choices  = session[:choices]
            Choice.where(question_id: @question["id"] ).each do |choice|

SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`name` = 'Tollywood'
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
UPDATE `leaderboards` SET `genre` = 1, `subgenre` = 1, `question` = 1, `total_qns` = 2, `attempted` = 1, `updated_at` = '2017-09-20 07:16:11' WHERE `leaderboards`.`id` = 22
---

            session[:current] += 1
        end
        id=Subgenre.where(:name => session[:subgenre])[0]
        x=Subgenre.find(id.id).genre_id
        u=Leaderboard.update(genre: x,user: session[:user_id],subgenre:id.id,question: session[:current],total_qns:session[:total],attempted:session[:current],score:session[:correct]*100)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
    def end
        @correct = session[:correct]
        @total   = session[:total]
        @current_user=User.find session[:user_id]