app/controllers/sessions_controller.rb

     def profile
         @user=session[:user_id]
         @leaderboards=Leaderboard.where(user: @user)
---
SELECT `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user` = 3