app/controllers/users_controller.rb

   def create
       	@user = User.new(user_params)
        if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `encrypted_password`, `salt`, `remember_token`) VALUES ('2017-09-15 16:13:17', '2017-09-15 16:13:17', '$2a$10$dqCzWKZDIqyA72FLQ/hQbOBhbhElyyijtdfgG7iPeYqSOSJrFtTou', '$2a$10$dqCzWKZDIqyA72FLQ/hQbO', '461bd2a085c4f861042464672af058df01f70b00')

    def add_participant
        @current_user = User.find session[:user_id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

    def create_participant
        @user = User.new(user_params)
        @current_user = User.find session[:user_id]
        if(@current_user.admin && @user.save)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `users` (`username`, `email`, `encrypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('abcdefgh', 'apparilalith@g.cOM', '$2a$10$m8c0NSlbLPqnjcSgwK3EEeTK1/daNx57Y6z/BZEpL3..M2rJ/e4OS', '$2a$10$m8c0NSlbLPqnjcSgwK3EEe', '2017-09-15 20:41:34', '2017-09-15 20:41:34')